	Select Подзапрос.Номенклатура [Номенклатура $Справочник.Номенклатура] 
		, sum(Подзапрос.Количество) КоличествоПродаж
//		, case when sum(Подзапрос.Количество) < 26 AND sum(Подзапрос.Количество) > 0then 52 else sum(Подзапрос.Количество) end СреднееКоличествоПродаж
		, sum(Подзапрос.ОстатокБольшогоСклада) ОстатокБольшогоСклада
		, sum(Подзапрос.ОстатокМалогоСклада) ОстатокМалогоСклада
		, $Номенклатура.Артикул Артикул
		, Номенклатура.DESCR Наименование
		, $Номенклатура.МинОстаток МинОстаток
		, ДатыПоступлений.МинимумДокумент_дата ДатаПервогоПоступления
		, DATEDIFF(wk, ДатыПоступлений.МинимумДокумент_дата, :КонДата) РазностьДат
		, DATEDIFF(wk, :НачДата, :КонДата) РазностьДатПериода
	FROM (
		SELECT $РеализацияСтроки.Номенклатура Номенклатура
			, $РеализацияСтроки.Количество Количество
			, 0 ОстатокБольшогоСклада
			, 0 ОстатокМалогоСклада
		FROM _1SJOURN AS Журнал With (NOLOCK)
			INNER JOIN $ДокументСтроки.Реализация AS РеализацияСтроки With (NOLOCK) ON Журнал.IDDOC = РеализацияСтроки.IDDOC
			INNER JOIN $Документ.Реализация AS Реализация With (NOLOCK) ON РеализацияСтроки.IDDOC = Реализация.IDDOC
		WHERE ((Журнал.CLOSED & 1) = 1) AND (Cast(Left(Журнал.DATE_TIME_IDDOC, 8) AS datetime) BETWEEN :НачДата AND :КонДата)
			AND (:ФильтрПоНоменклатуре = 1 OR $РеализацияСтроки.Номенклатура in (select val from #СписокНоменклатуры)) 
			AND ((:РежимФильтраПроектСклад = 1 AND (:ФильтрПоСкладам = 1 OR $Реализация.Склад in (select val from #СписокСкладов))) 
				or (:РежимФильтраПроектСклад = 2 AND (:ФильтрПоПроектам = 1 OR Журнал.$ОбщийРеквизит.Проект in (select val from #СписокПроектов))))
		UNION ALL
		SELECT $ВозвратОтПокупателяСтроки.Номенклатура
			, -$ВозвратОтПокупателяСтроки.Количество
			, 0
			, 0
		FROM _1SJOURN AS Журнал With (NOLOCK)
			INNER JOIN $ДокументСтроки.ВозвратОтПокупателя AS ВозвратОтПокупателяСтроки With (NOLOCK) ON Журнал.IDDOC = ВозвратОтПокупателяСтроки.IDDOC
			INNER JOIN $Документ.ВозвратОтПокупателя AS ВозвратОтПокупателя With (NOLOCK) ON ВозвратОтПокупателяСтроки.IDDOC = ВозвратОтПокупателя.IDDOC
		WHERE ((Журнал.CLOSED & 1) = 1) AND (Cast(Left(Журнал.DATE_TIME_IDDOC, 8) AS datetime) BETWEEN :НачДата AND :КонДата)
			AND (:ФильтрПоНоменклатуре = 1 OR $ВозвратОтПокупателяСтроки.Номенклатура in (select val from #СписокНоменклатуры)) 
			AND ((:РежимФильтраПроектСклад = 1 AND (:ФильтрПоСкладам = 1 OR $ВозвратОтПокупателя.Склад in (select val from #СписокСкладов)))
				or (:РежимФильтраПроектСклад = 2 AND (:ФильтрПоПроектам = 1 OR Журнал.$ОбщийРеквизит.Проект in (select val from #СписокПроектов))))
		UNION ALL
		SELECT ОстаткиБольшогоСклада.Номенклатура
			, 0
			, ОстаткиБольшогоСклада.КоличествоОстаток
			, 0
		FROM $РегистрОстатки.ОстаткиТМЦ(,,(:ФильтрПоНоменклатуре = 1 OR Номенклатура in (select val from #СписокНоменклатуры)) AND  Склад = :СкладОтправитель,
				Номенклатура,) AS ОстаткиБольшогоСклада
		UNION ALL
		SELECT РезервыБольшогоСклада.Номенклатура
			, 0
			, -РезервыБольшогоСклада.КоличествоОстаток
			, 0
		FROM $РегистрОстатки.РезервыТМЦ(,,(:ФильтрПоНоменклатуре = 1 OR Номенклатура in (select val from #СписокНоменклатуры)) AND Склад = :СкладОтправитель,
				Номенклатура,) AS РезервыБольшогоСклада
		UNION ALL
		SELECT ОстаткиМалогоСклада.Номенклатура
			, 0
			, 0
			, ОстаткиМалогоСклада.КоличествоОстаток
		FROM $РегистрОстатки.ОстаткиТМЦ(,,(:ФильтрПоНоменклатуре = 1 OR Номенклатура in (select val from #СписокНоменклатуры)) AND  Склад = :СкладПолучатель,
				Номенклатура,) AS ОстаткиМалогоСклада
		UNION ALL
		SELECT РезервыМалогоСклада.Номенклатура
			, 0
			, 0
			, -РезервыМалогоСклада.КоличествоОстаток
		FROM $РегистрОстатки.РезервыТМЦ(,,(:ФильтрПоНоменклатуре = 1 OR Номенклатура in (select val from #СписокНоменклатуры)) AND  Склад = :СкладПолучатель,
				Номенклатура,) AS РезервыМалогоСклада
	) Подзапрос
		LEFT JOIN $Справочник.Номенклатура AS Номенклатура With (NOLOCK) ON Подзапрос.Номенклатура = Номенклатура.ID
		LEFT JOIN (SELECT Номенклатура.ID Ссылка
			, NullIf(Min(Cast(Left(Журнал.DATE_TIME_IDDOC, 8) AS datetime)), '17530101') МинимумДокумент_дата
		FROM $Справочник.Номенклатура AS Номенклатура With (NOLOCK)
			INNER JOIN $ДокументСтроки.ПоступлениеТМЦ AS ПоступлениеТМЦСтроки With (NOLOCK) ON Номенклатура.ID = $ПоступлениеТМЦСтроки.Номенклатура
			INNER JOIN _1SJOURN AS Журнал With (NOLOCK) ON ПоступлениеТМЦСтроки.IDDOC = Журнал.IDDOC
		WHERE Журнал.DATE_TIME_IDDOC is not null
		GROUP BY Номенклатура.ID) AS ДатыПоступлений ON Номенклатура.ID = ДатыПоступлений.Ссылка
	group by Подзапрос.Номенклатура, $Номенклатура.Артикул, Номенклатура.DESCR, $Номенклатура.МинОстаток, ДатыПоступлений.МинимумДокумент_дата
	";
